#+TITLE: 效率: Rime 输入法(五笔)
#+DATE: <2020-04-19 Sun>
#+OPTIONS: toc:nil num:nil

有些工具, 属于前期投入成本高, 但价值半衰弱期长, 对应到重要不紧急的象限, 值得你花时间去研究. 输入法就是其中之一, 本文记录自己折腾 [[https://rime.im/][Rime]] 输入法的过程.

** 了解用户配置
Rime 输入法也有 =文本为王= 的理念. 它的 =配置文件= =输入方案定义= 以及 =词典文件= , 均是文本文件(YAML 格式), 使用 Emacs 编辑刚刚好.

在安装部署完成后, Rime 会在路径 =~/Library/Rime/= 存放 _用户资料_ , 主要包括:

 #+begin_src shell
 ls ~/Library/Rime
 #+end_src

 #+RESULTS:
 | installation.yaml | 安装信息     |
 | user.yaml         | 用户状态信息 |

*方案定义*

#+begin_example
Rime 中的输入方案 = 方案定义(<方案标识>.schema.yaml) +
                    词典文件(<词典名>.dict.yaml)
#+end_example

方案定义以 =wubi86_jidian.schema.yaml= 为例:
#+begin_example
schema:
  schema_id: wubi86_jidian  #Rime 识别的 ID
  name: "极点五笔 86"       #选择方案时显示的名称
  version: "1.0"
  author:
    - 创始人 王永民先生
  description: |
    五笔字形 86 极点极爽版
  dependencies:
    - pinyin_simp
#+end_example

词典文件以 =wubi86_jidian.dict.yaml= 为例:
#+begin_example
name: wubi86_jidian
version: "4.3"
sort: by_weight #by_weight/权重 original/原始
import_tables: #此处是添加用户自定义词库的地方
  - wubi86_jidian_user
columns: #码表格式
  - text #文字
  - code #输入码
  - weight #权重
  - stem
#+end_example

